tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

brew "mas"

## CLI
# -----------------------------------------------------------------------------
brew "bat"      # cat command, but prettier
brew "cowsay"   # lol
brew "glow"     # pretty markdown
brew "hub"      # github tools
brew "jq"       # pretty json
brew "stow"     # symlink all this shit
brew "tree"
brew "wget"
brew "delta" # better git diff
brew "wget"     # idk maybe

## Languages
# -----------------------------------------------------------------------------
brew "node"

## Language Deps
# -----------------------------------------------------------------------------
brew "nodenv"

## Fonts
# -----------------------------------------------------------------------------
cask "font-fira-code" # the goat

## VSCode extensions
# -----------------------------------------------------------------------------
vscode "bierner.markdown-mermaid"
vscode "dracula-theme.theme-dracula"
vscode "ericadamski.carbon-now-sh"  # `gram-able snippets
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "meganrogge.template-string-converter" # stop struggling with template strings
vscode "mikestead.dotenv"

## GUI apps
# -----------------------------------------------------------------------------
cask "firefox"
cask "google-chrome"
cask "1password"
cask "warp"
cask "visual-studio-code"
cask "spotify"
cask "vlc"
mas "Slack", id:803453959
mas "Magnet", id:441258766
mas "Pixelmator Pro", id:1289583905