tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

## CLI
brew "bat"
brew "cowsay"
brew "glow"
brew "hub"
brew "jq"
brew "stow"
brew "tree"
brew "wget"
brew "delta" # better git diff

## Fonts
cask "font-fira-code"

## VSCode extensions
vscode "bierner.markdown-mermaid"
vscode "dracula-theme.theme-dracula"
vscode "ericadamski.carbon-now-sh"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"

## GUI apps
mas "Slack", id:803453959
mas "Magnet", id:441258766